---
kind: other
id: Methods.T:Autodesk.Revit.DB.ThermalProperties
source: html/13d2289b-8c95-a14f-baa8-162a0181818c.htm
---
# ThermalProperties Methods

Causes the object to release immediately any resources it may be utilizing.